TODO.org
#+TITLE:     TODO.org
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+Time-stamp: <2014-05-14 Wed 20:50>
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en

#+SETUPFILE: ~/src/org-style/setup/bigblow-local-abs.setup

* Tasks

** TODO Follow coding conventions

http://wiki.bash-hackers.org/scripting/style

** TODO Rename this project on GitHub as Shellutils

** TODO Look at the Cygwin skeletons

- [[file:c:/cygwin/etc/skel/.bashrc]]
- [[file:c:/cygwin/etc/skel/.bash_profile]]
- [[file:c:/cygwin/etc/skel/.inputrc]]
- [[file:c:/cygwin/etc/skel/.profile]]

** TODO Remove Bashisms

- https://wiki.ubuntu.com/DashAsBinSh
- http://mywiki.wooledge.org/Bashism

** TODO Use printf instead of echo -e

See http://www.bashguru.com/2010/01/shell-colors-colorizing-shell-scripts.html.

** TODO Integrate goodies

See [[file:bin/bash-goodies][file:~/bin/bash-goodies]]

** TODO Look at color Bash prompt

https://wiki.archlinux.org/index.php/Color_Bash_Prompt
Very interesting settings!
