TODO.html
<!-- <xml version="1.0"> -->
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Cygwin (vers 1st September 2004), see www.w3.org" />

  <title>TODO.org</title>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta name="generator" content="Org-mode" />
  <meta name="author" content="Fabrice Niessen" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/bigblow.css" />
  <link rel="stylesheet" type="text/css" href=
  "file:///D:/Users/fni/src/org-style/styles/bigblow/css/hideshow.css" />






</head>

<body>
  <div id="content">
    <h1 class="title">TODO.org</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#sec-1">1. Tasks</a>

            <ul>
              <li><a href="#sec-1-1">1.1. <span class="todo TODO">TODO</span>
              Follow coding conventions</a></li>

              <li><a href="#sec-1-2">1.2. <span class="todo TODO">TODO</span>
              Rename this project on GitHub as Shellutils</a></li>

              <li><a href="#sec-1-3">1.3. <span class="todo TODO">TODO</span>
              Look at the Cygwin skeletons</a></li>

              <li><a href="#sec-1-4">1.4. <span class="todo TODO">TODO</span>
              Remove Bashisms</a></li>

              <li><a href="#sec-1-5">1.5. <span class="todo TODO">TODO</span>
              Use printf instead of echo -e</a></li>

              <li><a href="#sec-1-6">1.6. <span class="todo TODO">TODO</span>
              Integrate goodies</a></li>

              <li><a href="#sec-1-7">1.7. <span class="todo TODO">TODO</span>
              Look at color Bash prompt</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-sec-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> Tasks</h2>

      <div class="outline-text-2" id="text-1"></div>

      <div id="outline-container-sec-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class=
        "todo TODO">TODO</span> Follow coding conventions</h3>

        <div class="outline-text-3" id="text-1-1">
          <p><a href=
          "http://wiki.bash-hackers.org/scripting/style">http://wiki.bash-hackers.org/scripting/style</a></p>
        </div>
      </div>

      <div id="outline-container-sec-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class=
        "todo TODO">TODO</span> Rename this project on GitHub as
        Shellutils</h3>
      </div>

      <div id="outline-container-sec-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class=
        "todo TODO">TODO</span> Look at the Cygwin skeletons</h3>

        <div class="outline-text-3" id="text-1-3">
          <ul class="org-ul">
            <li><a href=
            "file://c:/cygwin/etc/skel/.bashrc">file://c:/cygwin/etc/skel/.bashrc</a></li>

            <li><a href=
            "file://c:/cygwin/etc/skel/.bash_profile">file://c:/cygwin/etc/skel/.bash_profile</a></li>

            <li><a href=
            "file://c:/cygwin/etc/skel/.inputrc">file://c:/cygwin/etc/skel/.inputrc</a></li>

            <li><a href=
            "file://c:/cygwin/etc/skel/.profile">file://c:/cygwin/etc/skel/.profile</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-sec-1-4" class="outline-3">
        <h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class=
        "todo TODO">TODO</span> Remove Bashisms</h3>

        <div class="outline-text-3" id="text-1-4">
          <ul class="org-ul">
            <li><a href=
            "https://wiki.ubuntu.com/DashAsBinSh">https://wiki.ubuntu.com/DashAsBinSh</a></li>

            <li><a href=
            "http://mywiki.wooledge.org/Bashism">http://mywiki.wooledge.org/Bashism</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-sec-1-5" class="outline-3">
        <h3 id="sec-1-5"><span class="section-number-3">1.5</span> <span class=
        "todo TODO">TODO</span> Use printf instead of echo -e</h3>

        <div class="outline-text-3" id="text-1-5">
          <p>See <a href=
          "http://www.bashguru.com/2010/01/shell-colors-colorizing-shell-scripts.html">
          http://www.bashguru.com/2010/01/shell-colors-colorizing-shell-scripts.html</a>.</p>
        </div>
      </div>

      <div id="outline-container-sec-1-6" class="outline-3">
        <h3 id="sec-1-6"><span class="section-number-3">1.6</span> <span class=
        "todo TODO">TODO</span> Integrate goodies</h3>

        <div class="outline-text-3" id="text-1-6">
          <p>See <a href="bin/bash-goodies"></a><a href=
          "file://d:/Users/fni/bin/bash-goodies">file://d:/Users/fni/bin/bash-goodies</a></p>
        </div>
      </div>

      <div id="outline-container-sec-1-7" class="outline-3">
        <h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class=
        "todo TODO">TODO</span> Look at color Bash prompt</h3>

        <div class="outline-text-3" id="text-1-7">
          <p><a href=
          "https://wiki.archlinux.org/index.php/Color_Bash_Prompt">https://wiki.archlinux.org/index.php/Color_Bash_Prompt</a>
          Very interesting settings!</p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <div id="footer">
      <div id="copyright">
        Copyright © Fabrice Niessen
      </div>
    </div>
  </div>
</body>
</html>
